In [3]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd
data = DataFrame(np.arange(16).reshape(4,4),
                index = ['ohio','colorado','utah','new york'],
                columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [4]:
data['two']

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [5]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [6]:
data.ix['colorado',['two','three']]

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: colorado, dtype: int32

In [8]:
data.ix[['colorado','utah'],[3,0,1]]

C:\Users\cleopathy\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
colorado     7    4    5
utah        11    8    9

In [13]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns = list('bcd'),
index = ['ohio','texas','colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns = list('bde'),
index = ['utah','ohio','texas','oregon'])

df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [14]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [15]:
df1+df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [16]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns = list('abcde'))

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [17]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [18]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [19]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
df1.reindex(columns=df2.columns,fill_value=0)
#use df2 columns name and fill nan with 0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [22]:
obj = Series(range(4),index =['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [24]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','four'],
               columns=['d','a','b','c'])
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
four   5  6  7  4

In [27]:
obj=pd.Series([4,np.nan,5,7,np.nan])
obj.sort_values()
#same with obj.order()

0    4.0
2    5.0
3    7.0
1    NaN
4    NaN
dtype: float64

In [30]:
#default order is ascending order
from pandas import Series
obj=Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64